Tekla Open API Reference for Tekla Structures 2025
Identifier.Equals Method (Identifier)
 Compares the identifier with another identifier instance.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	Identifier otherIdentifier
)
Public Function Equals (
	otherIdentifier As Identifier
) As Boolean
Parameters
otherIdentifier
Type: Tekla.Structures.Identifier
The identifier to compare with.
Return Value
Type: Boolean
True if the identifiers are equal, false otherwise.
See Also
Reference
Identifier Class
Equals Overload
Tekla.Structures Namespace